alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
#include "../../common/INTAN_config.h"

#include "../../common/values_macro.h"
#include "../../common/register_macro.h"

#include <math.h>
#include <stdbool.h> 
#include <msp430.h>
#include <stdio.h>
#include <stdint.h>  // Necesario para uint16_t
#include "functions/general_functions.h"

/*
    Functions for enabling and disabling the booleans described in the INTAN for MSP430
*/

void enable_M_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->M_flag = 1;
}
void enable_U_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->U_flag = 1;
}
void enable_H_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->H_flag = 1;
}
void enable_D_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->D_flag = 1;
}

void disable_M_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->M_flag = 0;
}
void disable_U_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->U_flag = 0;
}
void disable_H_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->H_flag = 0;
}
void disable_D_flag(INTAN_config_struct *INTAN_config){
    INTAN_config->D_flag = 0;
}

/*
    Function for initializing INTAN for the MSP430
*/

void initialize_INTAN(INTAN_config_struct* INTAN_config){
    disable_M_flag(INTAN_config);
    disable_U_flag(INTAN_config);
    disable_H_flag(INTAN_config);
    disable_D_flag(INTAN_config);

    INTAN_config->max_size = 0;
    unsigned i;
    for (i= MAX_VALUES; i > 0; i--) {
        INTAN_config->expected_RX[i-1] = 0;
        INTAN_config->obtained_RX[i-1] = 0;
        INTAN_config->expected_RX_bool[i-1] = 0;

    }
    INTAN_config->C2_enabled = false;

    INTAN_config->initial_channel_to_convert = 3;
    INTAN_config->step_DAC = 10;
    INTAN_config->waiting_trigger = false;
    
    INTAN_config->current_recovery = 20;
    INTAN_config->voltage_recovery = -1.225;
    INTAN_config->ADC_sampling_rate = 100;
    
    
    INTAN_config->zcheck_select = 0;
    INTAN_config->zcheck_DAC_enhable = 0;
    INTAN_config->zcheck_load = 0;
    INTAN_config->zcheck_scale = 0;
    INTAN_config->zcheck_en = 0;

    INTAN_config->zcheck_DAC_value = 0;


}


// Function used for sending SPI commands

/*While not all the commands have been sent:
    State 1:
        Update the packets to be sent in state 2
    State 2:
        Send the 4 packets and save the received values in the arrays for checking the values

  When all the commands have been sent:
    Check that the received values are correct using the function for checking it. 
    If the returned value of the function is false:
        enter a while loop and turn on the led for the INTAN configuration warning
    Else: exit the function

  */  
void send_SPI_commands(int state, INTAN_config_struct* INTAN_config, uint8_t* packet_1, uint8_t* packet_2, uint8_t* packet_3, uint8_t* packet_4){

    /*
    Se añade a la lista de envíos dos dummies para que se puedan comprobar todas las recepciones tras los envíos.
    Si no se hace esto entonces habría que implementar una lógica adicional de traslado de paquetes hacia el inicio de los que se han recibido y 
    comprobarlo más adelante, aciendo que el fallo venga más tarde de lo deseado y pudiendo producir un error indeseado como una configuración mala.
    */
    
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    reg_config_num += 1;

    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    reg_config_num += 1;
    
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;  

    uint16_t pckt_count = 0;
    uint8_t rx_packet_1 = 1;
    uint8_t rx_packet_2 = 2;
    uint8_t rx_packet_3 = 3;
    uint8_t rx_packet_4 = 4;

    while(pckt_count != INTAN_config->max_size){       
            
            // wait_1_second();
            
            OFF_CS_pin();
            __delay_cycles(CLK_5_CYCLES);

            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
            UCA0TXBUF = INTAN_config->array1[pckt_count];
            while (!(IFG2 & UCA0RXIFG));  // espera que RXBUF tenga el dato recibido
            rx_packet_1=UCA0RXBUF;
            __delay_cycles(CLK_2_CYCLES);

            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?
            UCA0TXBUF = INTAN_config->array2[pckt_count];
            while (!(IFG2 & UCA0RXIFG));  // espera que RXBUF tenga el dato recibido
            rx_packet_2=UCA0RXBUF;
            __delay_cycles(CLK_2_CYCLES);

            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?              
            UCA0TXBUF = INTAN_config->array3[pckt_count];
            while (!(IFG2 & UCA0RXIFG));  // espera que RXBUF tenga el dato recibido
            rx_packet_3=UCA0RXBUF;
            __delay_cycles(CLK_2_CYCLES);

            while (!(IFG2 & UCA0TXIFG));              // USART1 TX buffer ready?              
            UCA0TXBUF = INTAN_config->array4[pckt_count];
            while (!(IFG2 & UCA0RXIFG));  // espera que RXBUF tenga el dato recibido
            rx_packet_4=UCA0RXBUF;
            __delay_cycles(CLK_2_CYCLES);

            __delay_cycles(CLK_10_CYCLES);
            ON_CS_pin();   
            
            __delay_cycles(CLK_5_CYCLES);

            uint32_t rx_value = ((uint32_t)rx_packet_1 << 24) |
                ((uint32_t)rx_packet_2 << 16) |
                ((uint32_t)rx_packet_3 << 8)  |
                ((uint32_t)rx_packet_4);
            INTAN_config->obtained_RX[pckt_count] = rx_value;
            pckt_count += 1;
        
