alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    }
    pckt_count = 0;
    
    bool checked_rcvd = check_received_commands(INTAN_config);
    if (!checked_rcvd){
        // while(1){
            ON_INTAN_LED();
        // }
    }else{
         OFF_INTAN_LED();
    }
    INTAN_config->max_size = 0;
}


// Funtion used to check if the returned values are correct or not
bool check_received_commands(INTAN_config_struct* INTAN_config){
    uint16_t index;
    // If the value to be compared actually does not mean anything (as if it a read function) return true
    for (index = 0; index < INTAN_config->max_size-1; index++){
        if (INTAN_config->expected_RX_bool[index] == 1) {       
            if (index+2 >= MAX_VALUES){
                // Failure because more than the expected values have been sent and there is an index out of bounds.
                return false;
            }
            if (INTAN_config->obtained_RX[index+2] != INTAN_config->expected_RX[index]){
                INTAN_config->obtained_RX[index+2] = 0;
                INTAN_config->expected_RX[index] = 0;
                return false;
            }
                INTAN_config->obtained_RX[index+2] = 0;
                INTAN_config->expected_RX[index] = 0;
        }
        if (INTAN_config->instruction[index] == 'M'){
            int i;
            for (i = 0; i < 16; i++) {
                // Compare bit a bit if any has a value 1 this one is related to the reading of the register 40 in the compliance monitor
                if (INTAN_config->obtained_RX[index+2] & (1 << i)) {
                    perror("Initialyzing compliance monitor.");
                }
            }
          
        }
    }

    return true;
}

//Function to check if the INTAN is working at all
void check_intan_SPI_array(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;
}


void clear_command(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // uint8_t obtained_RX_i = INTAN_config->obtained_RX_i;
    // Comando de limpieza recomendado en la pg 33 para inicializar el ADC para su operación normal
    INTAN_config->array1[reg_config_num] = CLEAR_ACTION;
    INTAN_config->array2[reg_config_num] = ZEROS_8;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;


    if (INTAN_config->C2_enabled == false){
        INTAN_config->expected_RX[reg_config_num] = ZEROS_32;
    } else{
        INTAN_config->expected_RX[reg_config_num] = RETURN_CLEAR_2C;
    }
    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'L';


    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;

}

void write_command(INTAN_config_struct* INTAN_config, uint8_t R, uint16_t D){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // Flag U on M off
    if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == false)){
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;

    // Flag U off M on
    } else if ((INTAN_config->U_flag == false)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_M;
    
    // Flag U on M on
    }else if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_U_M;
    
    // Flag U off M off
    }else{
        INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    }

    INTAN_config->array2[reg_config_num] = R;
    uint8_t high_byte;
    uint8_t low_byte;

    split_uint16(D, &high_byte, &low_byte);
    INTAN_config->array3[reg_config_num] = high_byte;
    INTAN_config->array4[reg_config_num] = low_byte;
    uint32_t returned; 
    returned = unify_16bits(0b1111111111111111, D);
    INTAN_config->expected_RX[reg_config_num] = returned;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'W';

    reg_config_num += 1;

    INTAN_config->max_size = reg_config_num;

}

void read_command(INTAN_config_struct* INTAN_config, uint8_t R, char id){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // Flag U on M off
    if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == false)){
        INTAN_config->array1[reg_config_num] = READ_ACTION_U;

    // Flag U off M on
    } else if ((INTAN_config->U_flag == false)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = READ_ACTION_M;
    
    // Flag U on M on
    }else if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = READ_ACTION_U_M;
    
    // Flag U off M off
    }else{
        INTAN_config->array1[reg_config_num] = READ_ACTION;
    }

    INTAN_config->array2[reg_config_num] = R;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;

