alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    INTAN_config->expected_RX[reg_config_num] = ZEROS_32;
    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = id;

    reg_config_num += 1;

    INTAN_config->max_size = reg_config_num;
}



void fc_high(INTAN_config_struct* INTAN_config, char H_k, float_t freq){
    uint8_t RH1_sel1;
    uint8_t RH1_sel2;
    uint8_t RH2_sel1;
    uint8_t RH2_sel2;

    uint16_t RH1;
    uint16_t RH2;

    switch (H_k) {
        case 'k':
             if (freq == 20.0f){
                    RH1_sel1 = RH1_SEL1_20K;
                    RH1_sel2 = RH1_SEL2_20K;
                    RH2_sel1 = RH2_SEL1_20K;
                    RH2_sel2 = RH2_SEL2_20K;
                    }
              else if (freq == 15.0f){
                    RH1_sel1 = RH1_SEL1_15K;
                    RH1_sel2 = RH1_SEL2_15K;
                    RH2_sel1 = RH2_SEL1_15K;
                    RH2_sel2 = RH2_SEL2_15K;
                    }
              else if (freq == 10.0f){
                    RH1_sel1 = RH1_SEL1_10K;
                    RH1_sel2 = RH1_SEL2_10K;
                    RH2_sel1 = RH2_SEL1_10K;
                    RH2_sel2 = RH2_SEL2_10K;
                    }
              else if (freq == 7.5f){
                    RH1_sel1 = RH1_SEL1_7_5K;
                    RH1_sel2 = RH1_SEL2_7_5K;
                    RH2_sel1 = RH2_SEL1_7_5K;
                    RH2_sel2 = RH2_SEL2_7_5K;
                    }
              else if (freq == 5.0f){
                    RH1_sel1 = RH1_SEL1_5K;
                    RH1_sel2 = RH1_SEL2_5K;
                    RH2_sel1 = RH2_SEL1_5K;
                    RH2_sel2 = RH2_SEL2_5K;
                    }
              else if (freq == 3.0f){
                    RH1_sel1 = RH1_SEL1_3K;
                    RH1_sel2 = RH1_SEL2_3K;
                    RH2_sel1 = RH2_SEL1_3K;
                    RH2_sel2 = RH2_SEL2_3K;
                    }
              else if (freq == 2.5f){
                    RH1_sel1 = RH1_SEL1_2_5K;
                    RH1_sel2 = RH1_SEL2_2_5K;
                    RH2_sel1 = RH2_SEL1_2_5K;
                    RH2_sel2 = RH2_SEL2_2_5K;
                    }
              else if (freq == 2.0f){
                    RH1_sel1 = RH1_SEL1_2K;
                    RH1_sel2 = RH1_SEL2_2K;
                    RH2_sel1 = RH2_SEL1_2K;
                    RH2_sel2 = RH2_SEL2_2K;
                    }
              else if (freq == 1.5f){
                    RH1_sel1 = RH1_SEL1_1_5K;
                    RH1_sel2 = RH1_SEL2_1_5K;
                    RH2_sel1 = RH2_SEL1_1_5K;
                    RH2_sel2 = RH2_SEL2_1_5K;
                    }
              else if (freq == 1.0f){
                    RH1_sel1 = RH1_SEL1_1K;
                    RH1_sel2 = RH1_SEL2_1K;
                    RH2_sel1 = RH2_SEL1_1K;
                    RH2_sel2 = RH2_SEL2_1K;
                }
                
               else{     
                    perror("Error: high cutoff frequency Kilo.");
                        
               }
            break;

        case 'H':
                if (freq == 750){
                    RH1_sel1 = RH1_SEL1_750H;
                    RH1_sel2 = RH1_SEL2_750H;
                    RH2_sel1 = RH2_SEL1_750H;
                    RH2_sel2 = RH2_SEL2_750H;
                    }
                else if (freq == 500){
                    RH1_sel1 = RH1_SEL1_500H;
                    RH1_sel2 = RH1_SEL2_500H;
                    RH2_sel1 = RH2_SEL1_500H;
                    RH2_sel2 = RH2_SEL2_500H;
                    }
                else if (freq == 300){
                    RH1_sel1 = RH1_SEL1_300H;
                    RH1_sel2 = RH1_SEL2_300H;
                    RH2_sel1 = RH2_SEL1_300H;
                    RH2_sel2 = RH2_SEL2_300H;
                    }
                else if (freq == 250){
                    RH1_sel1 = RH1_SEL1_250H;
                    RH1_sel2 = RH1_SEL2_250H;
                    RH2_sel1 = RH2_SEL1_250H;
                    RH2_sel2 = RH2_SEL2_250H;
                    }
                else if (freq == 200){
                    RH1_sel1 = RH1_SEL1_200H;
                    RH1_sel2 = RH1_SEL2_200H;
                    RH2_sel1 = RH2_SEL1_200H;
                    RH2_sel2 = RH2_SEL2_200H;
                    }
                else if (freq == 150){
                    RH1_sel1 = RH1_SEL1_150H;
                    RH1_sel2 = RH1_SEL2_150H;
                    RH2_sel1 = RH2_SEL1_150H;
                    RH2_sel2 = RH2_SEL2_150H;
                    }
                else if (freq == 100){
                    RH1_sel1 = RH1_SEL1_100H;
                    RH1_sel2 = RH1_SEL2_100H;
                    RH2_sel1 = RH2_SEL1_100H;
                    RH2_sel2 = RH2_SEL2_100H;}
                else{
                    perror("Error: high cutoff frequency H.");
                    }    
            break;
        default:
            perror("Error: high cutoff frequency units.");
            break;    
    }
    RH1 = ((uint16_t)RH1_sel2 << 6) | RH1_sel1;
    RH2 = ((uint16_t)RH2_sel2 << 6) | RH2_sel1;

    // RH1 = unify_8bits(RH1_sel2, RH1_sel1);   
    // RH2 = unify_8bits(RH2_sel2, RH2_sel1);

    // Calls write command with the corresponding registers and frequency values
    write_command(INTAN_config, (uint8_t)ADC_HIGH_FREQ_4, RH1);
    write_command(INTAN_config, (uint8_t)ADC_HIGH_FREQ_5, RH2);

}

void fc_low_A(INTAN_config_struct* INTAN_config, float_t freq){
    uint8_t RL_SEL1;
    uint8_t RL_SEL2;
    uint8_t RL_SEL3;

    uint16_t RL;
    if (freq == 1000.0f){
        RL_SEL1 = RL_SEL1_1k;
        RL_SEL2 = RL_SEL2_1k;
        RL_SEL3 = RL_SEL3_1k;

    }else if(freq == 500.0f){
        RL_SEL1 = RL_SEL1_500H;
        RL_SEL2 = RL_SEL2_500H;
        RL_SEL3 = RL_SEL3_500H;

    }else if(freq == 300.0f){
        RL_SEL1 = RL_SEL1_300H;
        RL_SEL2 = RL_SEL2_300H;
        RL_SEL3 = RL_SEL3_300H;
        
    }else if(freq == 250.0f){
        RL_SEL1 = RL_SEL1_250H;
        RL_SEL2 = RL_SEL2_250H;
        RL_SEL3 = RL_SEL3_250H;
        
    }else if(freq == 200.0f){
        RL_SEL1 = RL_SEL1_200H;
        RL_SEL2 = RL_SEL2_200H;
        RL_SEL3 = RL_SEL3_200H;
        
    }else if(freq == 150.0f){
        RL_SEL1 = RL_SEL1_150H;
        RL_SEL2 = RL_SEL2_150H;
        RL_SEL3 = RL_SEL3_150H;
        
