alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
}

// step selection as DAC configuration as a general thing for the register 35
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t PBIAS;         // 7 bits
    uint8_t NBIAS;         // 6 bits
} BiasVoltageConfig;

static const BiasVoltageConfig bias_voltage_table[] = {
    // BiasVoltage   PBIAS       NBIAS       
    {  /*10nA*/ 10,      PBIAS_10nA,         NBIAS_10nA},  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*20nA*/ 20,      PBIAS_20nA,         NBIAS_20nA},  
    {  /*50nA*/ 50,      PBIAS_50nA,         NBIAS_50nA},
    {  /*100nA*/ 100,   PBIAS_100nA,        NBIAS_100nA},
    {  /*200nA*/ 200,   PBIAS_200nA,        NBIAS_200nA},
    {  /*500nA*/ 500,   PBIAS_500nA,        NBIAS_500nA},
    {  /*1uA*/ 1000,      PBIAS_1uA,          NBIAS_1uA},
    {  /*2uA*/ 2000,      PBIAS_2uA,          NBIAS_2uA},
    {  /*5uA*/ 5000,      PBIAS_5uA,          NBIAS_5uA},
    { /*10uA*/ 10000,    PBIAS_10uA,         NBIAS_10uA}
};

uint16_t vias_voltages_sel(uint16_t step_sel) {
    unsigned int i;
    for (i = (sizeof(bias_voltage_table) / sizeof(bias_voltage_table[0])) - 1; i < sizeof(bias_voltage_table) / sizeof(bias_voltage_table[0]); --i) {
        if (bias_voltage_table[i].current_nA == step_sel) {
            BiasVoltageConfig cfg = bias_voltage_table[i];
            uint16_t result = 0;
            result |= (cfg.PBIAS & 0x3F) << 8;
            result |= (cfg.NBIAS & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if step_sel is invalid
}


void stim_PNBIAS_configuration(INTAN_config_struct* INTAN_config){
    // uint16_t step_DAC_selected;
    uint16_t BIAS_selected = vias_voltages_sel(INTAN_config->step_DAC);
    write_command(INTAN_config, STIM_BIAS_VOLTAGE, BIAS_selected);

}

// Configuration of the current for each channel, channels start from 0 to 15
void stim_current_channel_configuration(INTAN_config_struct* INTAN_config, uint8_t channel, uint8_t neg_current_trim, uint8_t neg_current_mag, uint8_t pos_current_trim, uint8_t pos_current_mag){
    if (channel > 15){
        while(1){
            ON_INTAN_LED();
        }
    }
    uint8_t curr_reg_neg = channel + 64;
    uint8_t curr_reg_pos = channel + 96;
    uint16_t negative = unify_8bits(neg_current_trim, neg_current_mag);
    uint16_t positive = unify_8bits(pos_current_trim, pos_current_mag);
    write_command(INTAN_config, curr_reg_neg, negative);
    write_command(INTAN_config, curr_reg_pos, positive);
    if (!(INTAN_config->waiting_trigger)){
        INTAN_config->waiting_trigger = true;
    }
}



uint16_t unify_8bits(uint8_t high, uint8_t low) {
    return ((uint16_t)high << 8) | low;
}


uint32_t unify_16bits(uint16_t high, uint16_t low) {
    return ((uint32_t)high << 16) | low;
}

// Clean the compliance monitor register
void clean_compliance_monitor(INTAN_config_struct* INTAN_config){
    enable_M_flag(INTAN_config);
    read_command(INTAN_config, REGISTER_VALUE_TEST, 't');
    disable_M_flag(INTAN_config);    
}


// Check the compliance monitor to see if all the channels are in a correct charging position
void check_compliance_monitor(INTAN_config_struct* INTAN_config){
    read_command(INTAN_config, COMPLIANCE_MONITOR, 'M');
}

// Activate the charge recovery switch by connecting a channel to the stim_GND electrode witting in channel 46. 
// Channels are connected one by one.
void connect_channel_to_gnd(INTAN_config_struct* INTAN_config, uint8_t channel){
    if (channel > 15){
        ON_INTAN_LED();
          perror("Trying to connect a too high channel to gnd.");
        while(1);
    }
    write_command(INTAN_config, CHRG_RECOV_SWITCH, channel+1);
    INTAN_config->waiting_trigger = true;
}


// Recovery current limited to get to the Vrecov
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t sel1;         // 7 bits
    uint8_t sel2;         // 6 bits
    uint8_t sel3;         // 2 bits
} chrg_recov_curr_lim_config;

static const chrg_recov_curr_lim_config chrg_recov_curr_lim_table[] = {
    // step_sel   sel1       sel2       sel3
    {  /*1nA*/ 1,        CL_SEL1_1nA,         CL_SEL2_1nA,         CL_SEL3_1nA },  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*2nA*/ 2,        CL_SEL1_2nA,         CL_SEL2_2nA,         CL_SEL3_2nA },  
    {  /*5nA*/ 5,        CL_SEL1_5nA,         CL_SEL2_5nA,         CL_SEL3_5nA },
    {  /*10nA*/ 10,     CL_SEL1_10nA,        CL_SEL2_10nA,         CL_SEL3_10nA },
    {  /*20nA*/ 20,     CL_SEL1_20nA,        CL_SEL2_20nA,         CL_SEL3_20nA },
    {  /*50nA*/ 50,     CL_SEL1_50nA,        CL_SEL2_50nA,         CL_SEL3_50nA },
    {  /*100nA*/ 100,  CL_SEL1_100nA,       CL_SEL2_100nA,         CL_SEL3_100nA },
    {  /*200nA*/ 200,  CL_SEL1_200nA,       CL_SEL2_200nA,         CL_SEL3_200nA },
    {  /*500nA*/ 500,  CL_SEL1_500nA,       CL_SEL2_500nA,         CL_SEL3_500nA },
    {  /*1000nA*/ 1000,  CL_SEL1_1uA,         CL_SEL2_1uA,         CL_SEL3_1uA }
};

uint16_t chrg_recov_curr_lim_united(uint16_t curr_lim_sel) {
    unsigned int i;
    for (i = (sizeof(chrg_recov_curr_lim_table) / sizeof(chrg_recov_curr_lim_table[0])) - 1; i < sizeof(chrg_recov_curr_lim_table) / sizeof(chrg_recov_curr_lim_table[0]); --i) {
        if (chrg_recov_curr_lim_table[i].current_nA == curr_lim_sel) {
            chrg_recov_curr_lim_config cfg = chrg_recov_curr_lim_table[i];
            uint16_t result = 0;
            result |= (cfg.sel3 & 0x03) << 13;
            result |= (cfg.sel2 & 0x3F) << 7;
            result |= (cfg.sel1 & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if curr_lim_sel is invalid
}

void charge_recovery_current_configuration(INTAN_config_struct* INTAN_config){
    uint16_t current_lim_sel = chrg_recov_curr_lim_united(INTAN_config->current_recovery);
    write_command(INTAN_config, CHARGE_RECOVERY_CURRENT_LIMIT, current_lim_sel);
}


// Voltage at witch the electrodes will be driven with a concrete current value
void charge_recovery_voltage_configuration(INTAN_config_struct* INTAN_config){
    double voltage = INTAN_config->voltage_recovery;
    // Force the value of the voltage to be between +1.225 and -1.215

    if (voltage < -1.225) voltage = -1.225;
    if (voltage >  1.215) voltage =  1.215;

    // Transformación: valor_reg = 128 + (V / 0.00957)
    int value = (int)round(128.0 + (voltage / 0.00957));

