alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    // Make sure is beatween 0 and 255
    if (value < 0)   value = 0;
    if (value > 255) value = 255;

    write_command(INTAN_config, CURRENT_LIMITED_CHARGE_RECOVERY_VOLTAGE_TARGET, value);

}


// ADC Buffer Bias Current related registers
void ADC_sampling_rate_config(INTAN_config_struct* INTAN_config){
    uint16_t sampling_rate = INTAN_config->ADC_sampling_rate;
    uint8_t ADC_buffer_bias;
    uint8_t MUX_bias;
        if (sampling_rate <= 120){
            ADC_buffer_bias = ADC_BUFFER_BIAS_less_120k;
            MUX_bias = MUX_BIAS_less_120k;
        } else if (sampling_rate > 120 & sampling_rate <= 140) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_140k;
            MUX_bias = MUX_BIAS_140k;
        } else if (sampling_rate > 140 & sampling_rate <= 175) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_175k;
            MUX_bias = MUX_BIAS_175k;        
        } else if (sampling_rate > 175 & sampling_rate <= 220) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_220k;
            MUX_bias = MUX_BIAS_220k;        
        } else if (sampling_rate > 220 & sampling_rate <= 280) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_280k;
            MUX_bias = MUX_BIAS_280k;        
        } else if (sampling_rate > 280 & sampling_rate <= 350) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_350k;
            MUX_bias = MUX_BIAS_350k;        
        } else if (sampling_rate > 350 & sampling_rate <= 440) {
            ADC_buffer_bias = ADC_BUFFER_BIAS_440k;
            MUX_bias = MUX_BIAS_440k;        
        } else {
            ADC_buffer_bias = ADC_BUFFER_BIAS_more_440k;
            MUX_bias = MUX_BIAS_more_440k;                
        }

    uint16_t bias_value = ((uint16_t)ADC_buffer_bias << 6) | MUX_bias;

    write_command(INTAN_config, ADC_BIAS_BUFFER, bias_value);
    
    
}


// Impedance check control register 2 configuration
void impedance_check_control(INTAN_config_struct* INTAN_config){
    uint8_t zcheck_select = INTAN_config->zcheck_select;
    bool zcheck_DAC_enhable = INTAN_config->zcheck_DAC_enhable;
    bool zcheck_load = INTAN_config->zcheck_load;
    uint8_t zcheck_scale = INTAN_config->zcheck_scale;
    bool zcheck_en = INTAN_config->zcheck_en;
    
    if (zcheck_select > 15){
        ON_INTAN_LED();
        while(1);
    }
    
    uint16_t reg_value = ((uint16_t)zcheck_select << 8) | ((uint16_t)zcheck_DAC_enhable << 6) | ((uint16_t)zcheck_load << 5) | ((uint16_t)zcheck_scale << 3) | zcheck_en;
    write_command(INTAN_config, IMPEDANCE_CHECK_CONTROL, reg_value);
}

// Impedance check DAC value
void impedance_check_DAC(INTAN_config_struct* INTAN_config){
    write_command(INTAN_config, IMPEDANCE_CHECK_DAC, INTAN_config->zcheck_DAC_value);

}





























/**
 * Splits a 16-bit value into two 8-bit values.
 *
 * @param input     The 16-bit input value.
 * @param high_byte Pointer to store the high (most significant) 8 bits.
 * @param low_byte  Pointer to store the low (least significant) 8 bits.
 */
void split_uint16(uint16_t input, uint8_t* high_byte, uint8_t* low_byte) {
    if (high_byte) {
        *high_byte = (input >> 8) & 0xFF;  // Get the upper 8 bits
    }
    if (low_byte) {
        *low_byte = input & 0xFF;          // Get the lower 8 bits
    }
}

uint8_t calculate_current_lim_chr_recov(float target_voltage){
    if ((target_voltage > 1.225)||((target_voltage < -1.225))){
        return 0;
    }
    uint8_t dac_value = (uint8_t)roundf((target_voltage / 0.00957f) + 128.0f);
    return dac_value;
}

uint8_t calculate_stim_current(INTAN_config_struct* INTAN_config, uint16_t I_target_nA){
    uint8_t magnitude = (uint8_t)(I_target_nA / INTAN_config->step_sel);
    return magnitude;
}


void create_example_SPI_arrays(INTAN_config_struct* INTAN_config){
    uint8_t step_H;
    uint8_t step_L;
    split_uint16(step_sel_united(INTAN_config->step_sel), &step_H, &step_L);

    uint16_t BiasVol; 
    BiasVol = vias_voltages_sel(INTAN_config->step_sel);

    uint8_t dac_value;
    dac_value = calculate_current_lim_chr_recov(INTAN_config->target_voltage);

    uint8_t CL_H;
    uint8_t CL_L;
    split_uint16(chrg_recov_curr_lim_united(INTAN_config->CL_sel), &CL_H, &CL_L);



    uint16_t reg_config_num = 0;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;
    
    // Testing -- it will be deleted
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = VALUES_VALUE_TEST_H;
    INTAN_config->array4[reg_config_num] = VALUES_VALUE_TEST_L;
    reg_config_num++;
    
    //REGISTER 32: Enable - disable stimulation
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_ENABLE_A_reg;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    //REGISTER 33: Enable - disable stimulation
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_ENABLE_B_reg;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    //REGISTER 34: Stimulation Current Step Size
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_STEP_SIZE;
    INTAN_config->array3[reg_config_num] = step_H;
    INTAN_config->array4[reg_config_num] = step_L;
    reg_config_num++;

    //REGISTER 35: Stimulation Bias Voltages
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_BIAS_VOLTAGE;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = BiasVol;
    reg_config_num++;

    //REGISTER 36: Current-Limited Charge Recovery Target Voltage
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = CURRENT_LIMITED_CHARGE_RECOVERY_VOLTAGE_TARGET;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = dac_value;
    reg_config_num++;
    
