alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    //REGISTER 37: Charge Recovery Current Limit
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = CHARGE_RECOVERY_CURRENT_LIMIT;
    INTAN_config->array3[reg_config_num] = CL_H;
    INTAN_config->array4[reg_config_num] = CL_L;
    reg_config_num++;

    //REGISTER 38: Individual DC Amplifier Power
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = DC_AMPLIFIER_POWER;
    INTAN_config->array3[reg_config_num] = ONES_8;
    INTAN_config->array4[reg_config_num] = ONES_8;
    reg_config_num++;

    //REGISTER 40: Compliance Monitor (READ ONLY REGISTER WITH CLEAR)  - write action with clear
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_M;
    INTAN_config->array2[reg_config_num] = COMPLIANCE_MONITOR;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;


    //REGISTER 40: Compliance Monitor (READ ONLY REGISTER WITH CLEAR)  - read action
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = COMPLIANCE_MONITOR;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    //REGISTER 40: Compliance Monitor (READ ONLY REGISTER WITH CLEAR)  - read action with clear
    INTAN_config->array1[reg_config_num] = READ_ACTION_M;
    INTAN_config->array2[reg_config_num] = COMPLIANCE_MONITOR;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    //REGISTER 42: Stimulator On-Off (TRIGGERED REGISTER) - stimulation OFF
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = STIM_ON;
    INTAN_config->array3[reg_config_num] = ALL_CH_OFF;
    INTAN_config->array4[reg_config_num] = ALL_CH_OFF;
    reg_config_num++;

    //REGISTER 42: Stimulator On (TRIGGERED REGISTER) - stimulation ON in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = STIM_ON;
    INTAN_config->array3[reg_config_num] = CH_2_ON_L+CH_7_ON_L;
    INTAN_config->array4[reg_config_num] = CH_12_ON_H;
    reg_config_num++;


    //REGITER 44: Stimulator Polarity (TRIGGERED REGISTER) - stimulation positive in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = STIM_POLARITY;
    INTAN_config->array3[reg_config_num] = CH_2_ON_L+CH_7_ON_L;
    INTAN_config->array4[reg_config_num] = CH_12_ON_H;
    reg_config_num++;



    //REGISTER 46: Charge Recovery Switch (TRIGGERED REGISTER) - activated in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CHRG_RECOV_SWITCH;
    INTAN_config->array3[reg_config_num] = CH_2_ON_L+CH_7_ON_L;
    INTAN_config->array4[reg_config_num] = CH_12_ON_H;
    reg_config_num++;

    //REGISTER 48: Current-Limited Charge Recovery Enable (TRIGGERED REGISTER) - activated in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CURR_LIM_CHRG_RECOV_EN;
    INTAN_config->array3[reg_config_num] = CH_2_ON_L+CH_7_ON_L;
    INTAN_config->array4[reg_config_num] = CH_12_ON_H;
    reg_config_num++;

    //REGISTER 50:  Fault Current Detector (READ ONLY REGISTER) -
    // si se lee un valor de corriente peligroso, se podría realizar alguna acción que (por ejemplo) deshabilite la estimulación
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = FAULT_CURR_DET;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;



    uint8_t negative_current;
    negative_current = calculate_stim_current(INTAN_config, 1000);

    uint8_t trim_neg;
    trim_neg = 0;

    
    //REGISTER 64-79: Negative Stimulation Current Magnitude (TRIGGERED REGISTERS) - config ch 0 
    //Utiliza el valor de la configuración que hay en el step size,
    // si queremos utilizar un valor diferente habría que actualizarlo antes de utilizarlo
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = CH0_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = trim_neg;
    INTAN_config->array4[reg_config_num] = negative_current;
    reg_config_num++;



    uint8_t positive_current;
    positive_current = calculate_stim_current(INTAN_config, 1000);

    uint8_t trim_pos;
    trim_pos= 0;
    
    //REGISTER 96-111: Positive Stimulation Current Magnitude (TRIGGERED REGISTERS)  - config ch 0 
    //Utiliza el valor de la configuración que hay en el step size,
    // si queremos utilizar un valor diferente habría que actualizarlo antes de utilizarlo
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = CH0_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = trim_pos;
    INTAN_config->array4[reg_config_num] = positive_current;
    reg_config_num++;

    INTAN_config->max_size = reg_config_num;

}


void create_stim_SPI_arrays(INTAN_config_struct* INTAN_config){
    uint8_t step_H;
    uint8_t step_L;
    split_uint16(step_sel_united(INTAN_config->step_sel), &step_H, &step_L);

    uint16_t BiasVol; 
    BiasVol = vias_voltages_sel(INTAN_config->step_sel);

    uint8_t dac_value;
    dac_value = calculate_current_lim_chr_recov(INTAN_config->target_voltage);

    uint8_t CL_H;
    uint8_t CL_L;
    split_uint16(chrg_recov_curr_lim_united(INTAN_config->CL_sel), &CL_H, &CL_L);

    uint8_t CH_ON_selected_L = CH_2_ON_L+CH_7_ON_L;
    uint8_t CH_ON_selected_H = CH_12_ON_H;

    uint16_t reg_config_num = 0;
    
    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

