alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    //2.  Asegurar que la estimulación está deshabilitada
    //REGISTER 32: Enable - disable stimulation
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_ENABLE_A_reg;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    //REGISTER 33: Enable - disable stimulation
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_ENABLE_B_reg;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    //3.  Encender todos los amplificadores de baja ganancia con acoplamiento DC para evitar un consumo excesivo de energía a causa de un error de HW
    // Si está a cero, se consumen 30.9mA adicionales de VDD
    //REGISTER 38: Individual DC Amplifier Power
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = DC_AMPLIFIER_POWER;
    INTAN_config->array3[reg_config_num] = ONES_8;
    INTAN_config->array4[reg_config_num] = ONES_8;
    reg_config_num++;

    // hay un monton de pasos entre medias relacionados con la parte de los ADC que vamos a ignorar... de momento
    
    //4.  Configurar el tamaño de paso de estimulacion (34)
    //REGISTER 34: Stimulation Current Step Size
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_STEP_SIZE;
    INTAN_config->array3[reg_config_num] = step_H;
    INTAN_config->array4[reg_config_num] = step_L;
    reg_config_num++;

    //5.  Establecer voltajes de polarizacion de estimulacion para el paso establecido en el registro 34 (35)
    //REGISTER 35: Stimulation Bias Voltages
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_BIAS_VOLTAGE;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = BiasVol;
    reg_config_num++;
    
    //6.  Establecer el voltaje objetivo de recuperacion de carga limitada en corriente (36)
    //REGISTER 36: Current-Limited Charge Recovery Target Voltage
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = CURRENT_LIMITED_CHARGE_RECOVERY_VOLTAGE_TARGET;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = dac_value;
    reg_config_num++;    
    
    //7.  Establecer el límite de corriente de recuperación de carga (37)
    //REGISTER 37: Charge Recovery Current Limit
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = CHARGE_RECOVERY_CURRENT_LIMIT;
    INTAN_config->array3[reg_config_num] = CL_H;
    INTAN_config->array4[reg_config_num] = CL_L;
    reg_config_num++;

    //8.  Apagar todos los estimuladores (con U activa) (42)
    //REGISTER 42: Stimulator On-Off (TRIGGERED REGISTER) - stimulation OFF
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = STIM_ON;
    INTAN_config->array3[reg_config_num] = ALL_CH_OFF;
    INTAN_config->array4[reg_config_num] = ALL_CH_OFF;
    reg_config_num++;

    //9.  Establece todos los estimuladores en polaridad negativa (44)
    //REGITER 44: Stimulator Polarity (TRIGGERED REGISTER) - stimulation positive in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = STIM_POLARITY;
    INTAN_config->array3[reg_config_num] = CH_ON_selected_H;
    INTAN_config->array4[reg_config_num] = CH_ON_selected_L;
    reg_config_num++;

    //10. Abre todos los interruptores de recuperación de carga (46)
    //REGISTER 46: Charge Recovery Switch (TRIGGERED REGISTER) - activated in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CHRG_RECOV_SWITCH;
    INTAN_config->array3[reg_config_num] = CH_ON_selected_H;
    INTAN_config->array4[reg_config_num] = CH_ON_selected_L;
    reg_config_num++;

    //11. Abre todos los interruptores de recuperación de carga limitada en corriente (48)
    //REGISTER 48: Current-Limited Charge Recovery Enable (TRIGGERED REGISTER) - activated in 3 different registers
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CURR_LIM_CHRG_RECOV_EN;
    INTAN_config->array3[reg_config_num] = CH_ON_selected_H;
    INTAN_config->array4[reg_config_num] = CH_ON_selected_L;
    reg_config_num++;

    //12. Establece las corrientes negativas de estimulacion en cero centrando los ajustes de corriente (64...)
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH0_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;
    
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH1_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH2_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH3_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH4_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH5_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH6_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH7_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH8_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH9_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH10_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH11_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH12_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH13_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH14_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH15_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

